balazsgrill/modembed/res/Devices/dsPIC33/PIC24HJ128GP210.PIC
      <edc:DCRDef edc:access="--------nn-nnnnn" edc:cname="FWDT" edc:default="0xffff" edc:desc="" edc:impl="0xdf" edc:name="FWDT" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xdf">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="WDTPOST" edc:desc="Watchdog Timer Postscaler" edc:mask="0xf" edc:name="WDTPOST" edc:nzwidth="0x4">
              <edc:DCRFieldSemantic edc:cname="PS32768" edc:desc="1:32,768" edc:when="(field &amp; 0xf) == 0xf"/>
              <edc:DCRFieldSemantic edc:cname="PS16384" edc:desc="1:16,384" edc:when="(field &amp; 0xf) == 0xe"/>
              <edc:DCRFieldSemantic edc:cname="PS8192" edc:desc="1:8,192" edc:when="(field &amp; 0xf) == 0xd"/>
              <edc:DCRFieldSemantic edc:cname="PS4096" edc:desc="1:4,096" edc:when="(field &amp; 0xf) == 0xc"/>
              <edc:DCRFieldSemantic edc:cname="PS2048" edc:desc="1:2,048" edc:when="(field &amp; 0xf) == 0xb"/>
              <edc:DCRFieldSemantic edc:cname="PS1024" edc:desc="1:1,024" edc:when="(field &amp; 0xf) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="PS512" edc:desc="1:512" edc:when="(field &amp; 0xf) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="PS256" edc:desc="1:256" edc:when="(field &amp; 0xf) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="PS128" edc:desc="1:128" edc:when="(field &amp; 0xf) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="PS64" edc:desc="1:64" edc:when="(field &amp; 0xf) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="PS32" edc:desc="1:32" edc:when="(field &amp; 0xf) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="PS16" edc:desc="1:16" edc:when="(field &amp; 0xf) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="PS8" edc:desc="1:8" edc:when="(field &amp; 0xf) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="PS4" edc:desc="1:4" edc:when="(field &amp; 0xf) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="PS2" edc:desc="1:2" edc:when="(field &amp; 0xf) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PS1" edc:desc="1:1" edc:when="(field &amp; 0xf) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDTPRE" edc:desc="WDT Prescaler" edc:mask="0x1" edc:name="WDTPRE" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="PR128" edc:desc="1:128" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PR32" edc:desc="1:32" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="WINDIS" edc:desc="Watchdog Timer Window" edc:mask="0x1" edc:name="WINDIS" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Watchdog Timer in Non-Window mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Watchdog Timer in Window mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FWDTEN" edc:desc="Watchdog Timer Enable" edc:mask="0x1" edc:name="FWDTEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Watchdog timer always enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Watchdog timer enabled/disabled by user software" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="--------nnn--nnn" edc:cname="FPOR" edc:default="0xffff" edc:desc="" edc:impl="0xe7" edc:name="FPOR" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xe7">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="FPWRT" edc:desc="POR Timer Value" edc:mask="0x7" edc:name="FPWRT" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="PWR128" edc:desc="128ms" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="PWR64" edc:desc="64ms" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="PWR32" edc:desc="32ms" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="PWR16" edc:desc="16ms" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="PWR8" edc:desc="8ms" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="PWR4" edc:desc="4ms" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="PWR2" edc:desc="2ms" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PWR1" edc:desc="Disabled" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:DCRFieldDef edc:cname="NONE" edc:desc="Reserved" edc:ishidden="true" edc:mask="0x7" edc:name="RES" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="--------nnn---nn" edc:cname="FICD" edc:default="0xffdf" edc:desc="" edc:impl="0xe3" edc:name="FICD" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xe3">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="ICS" edc:desc="Comm Channel Select" edc:mask="0x3" edc:name="ICS" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="PGD1" edc:desc="Communicate on PGC1/EMUC1 and PGD1/EMUD1" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="PGD2" edc:desc="Communicate on PGC2/EMUC2 and PGD2/EMUD2" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="PGD3" edc:desc="Communicate on PGC3/EMUC3 and PGD3/EMUD3" edc:when="(field &amp; 0x3) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:DCRFieldDef edc:cname="JTAGEN" edc:desc="JTAG Port Enable" edc:mask="0x1" edc:name="JTAGEN" edc:nzwidth="0x1" init="0x0">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="JTAG is Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="JTAG is Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="COE" edc:desc="Set Clip On Emulation Mode" edc:ishidden="true" edc:mask="0x1" edc:name="COE" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Reset Into Operational Mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Reset Into Clip On Emulation Mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BACKBUG" edc:desc="Background Debug" edc:ishidden="true" edc:mask="0x1" edc:name="BACKBUG" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
    <edc:UserIDSector edc:beginaddr="0xf80010" edc:endaddr="0xf80018" edc:regionid="userid">
      <edc:DCRDef edc:access="--------nnnnnnnn" edc:cname="FUID0" edc:default="0xffff" edc:desc="" edc:impl="0x0" edc:name="FUID0" edc:nzwidth="16" edc:unimplval="0" edc:unused="0" edc:useinchecksum="0xffff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="UID0" edc:desc="" edc:mask="0xff" edc:name="UID0" edc:nzwidth="8"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="--------nnnnnnnn" edc:cname="FUID1" edc:default="0xffff" edc:desc="" edc:impl="0x0" edc:name="FUID1" edc:nzwidth="16" edc:unimplval="0" edc:unused="0" edc:useinchecksum="0xffff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="UID1" edc:desc="" edc:mask="0xff" edc:name="UID1" edc:nzwidth="8"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="--------nnnnnnnn" edc:cname="FUID2" edc:default="0xffff" edc:desc="" edc:impl="0x0" edc:name="FUID2" edc:nzwidth="16" edc:unimplval="0" edc:unused="0" edc:useinchecksum="0xffff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="UID2" edc:desc="" edc:mask="0xff" edc:name="UID2" edc:nzwidth="8"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="--------nnnnnnnn" edc:cname="FUID3" edc:default="0xffff" edc:desc="" edc:impl="0x0" edc:name="FUID3" edc:nzwidth="16" edc:unimplval="0" edc:unused="0" edc:useinchecksum="0xffff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="UID3" edc:desc="" edc:mask="0xff" edc:name="UID3" edc:nzwidth="8"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
